#### FailureDefinitionRegistry Members

---

|  |
| --- |
| FailureDefinitionRegistry Class   Methods   Properties   See Also |

The  FailureDefinitionRegistry  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FailureDefinitionRegistry |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | FindFailureDefinition | Finds a specific FailureDefinition by a given FailureDefinitionId. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ListAllFailureDefinitions | Retrieves all the registered FailureDefinitions. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FailureDefinitionRegistry Class

Autodesk.Revit.DB Namespace